gcristini/SkorpioTemperatureTest/PSOC-Firmware/SerialTemperatureSensor.cydsn/Generated_Source/PSoC4/ADC_FILTER.h
/*******************************************************************************
* Low-Q definitions
*******************************************************************************/

#define ADC_UABH_A_LOWQSTAT_SW_CA_IN0 ((CyUAB_CLK_PHI5 << CyUAB_SW_AP_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_A0_MODBIT_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_A1_MODBIT_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_A2_MODBIT_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_A3_MODBIT_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_AQ_SHIFT))

#define ADC_UABH_A_LOWQSTAT_SW_CA_TOP ((CyUAB_CLK_PHI5 << CyUAB_SW_SA_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_RA_MODBIT_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_GA_MODBIT_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_VA_MODBIT_SHIFT))

#define ADC_UABH_A_LOWQSTAT_SW_CC_IN0 ((CyUAB_CLK_PHI1 << CyUAB_SW_CQ_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_C0_MODBIT_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_C1_MODBIT_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_C2_MODBIT_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_C3_MODBIT_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_CP_SHIFT))

#define ADC_UABH_A_LOWQSTAT_SW_CC_IN1 ((CyUAB_CLK_PHI2 << CyUAB_SW_CG_MODBIT_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_CC_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_CR_MODBIT_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_CV_MODBIT_SHIFT))

#define ADC_UABH_A_LOWQSTAT_SW_CF_BOT ((CyUAB_CLK_PHI5 << CyUAB_SW_PF_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_GF_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_PS_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_PO_SHIFT))

#define ADC_UABH_B_LOWQSTAT_SW_CA_IN0 ((CyUAB_CLK_PHI2 << CyUAB_SW_AP_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_A0_MODBIT_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_A1_MODBIT_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_A2_MODBIT_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_A3_MODBIT_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_AQ_SHIFT))

#define ADC_UABH_B_LOWQSTAT_SW_CA_IN1 ((CyUAB_CLK_PHI1 << CyUAB_SW_AG_MODBIT_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_AA_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_AR_MODBIT_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_AV_MODBIT_SHIFT))

#define ADC_UABH_B_LOWQSTAT_SW_CA_TOP ((CyUAB_CLK_PHI2 << CyUAB_SW_SA_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_RA_MODBIT_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_VA_MODBIT_SHIFT) \
                                                |   (CyUAB_CLK_PHI1 << CyUAB_SW_GA_MODBIT_SHIFT))

#define ADC_UABH_B_LOWQSTAT_SW_CB_IN0 ((CyUAB_CLK_PHI1 << CyUAB_SW_BQ_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_B0_MODBIT_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_B1_MODBIT_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_B2_MODBIT_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_B3_MODBIT_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_BP_SHIFT))

#define ADC_UABH_B_LOWQSTAT_SW_CB_IN1 ((CyUAB_CLK_PHI2 << CyUAB_SW_BG_MODBIT_SHIFT) \
                                                |  (CyUAB_CLK_PHI4 << CyUAB_SW_BR_MODBIT_SHIFT) \
                                                |  (CyUAB_CLK_PHI4 << CyUAB_SW_BV_MODBIT_SHIFT) \
                                                |  (CyUAB_CLK_PHI4 << CyUAB_SW_BB_SHIFT))

#define ADC_UABH_B_LOWQSTAT_SW_CB_TOP ((CyUAB_CLK_PHI2 << CyUAB_SW_SB_SHIFT) \
                                                 | (CyUAB_CLK_PHI1 << CyUAB_SW_GB_MODBIT_SHIFT) \
                                                 | (CyUAB_CLK_PHI4 << CyUAB_SW_RB_MODBIT_SHIFT) \
                                                 | (CyUAB_CLK_PHI4 << CyUAB_SW_VB_MODBIT_SHIFT) \
                                                 | (CyUAB_CLK_PHI5 << CyUAB_SW_TB_SHIFT))


#define ADC_UABH_B_LOWQSTAT_SW_CC_IN0 ((ADC_UABH_ALL_OPEN_CC_IN0 \
                                                &   ~((uint32)CyUAB_CLOCK_MASK << (ADC_UABH_B_halfuab__X0 << 2u))) \
                                                |   ((uint32)CyUAB_CLK_PHI5 << (ADC_UABH_B_halfuab__X0 << 2u)))

#define ADC_UABH_B_LOWQSTAT_SW_CC_IN1 ((CyUAB_CLK_PHI4 << CyUAB_SW_CG_MODBIT_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_CR_MODBIT_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_CV_MODBIT_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_CC_SHIFT))

#define ADC_UABH_B_LOWQSTAT_SW_CF_BOT ((CyUAB_CLK_PHI5 << CyUAB_SW_PF_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_GF_SHIFT) \
                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_PS_SHIFT) \
                                                |   (CyUAB_CLK_PHI3 << CyUAB_SW_PO_SHIFT))


