gcristini/SkorpioTemperatureTest/PSOC-Firmware/SerialTemperatureSensor.cydsn/Generated_Source/PSoC4/ADC_FILTER.h
    #define ADC_CFG1_FILTERTYPE_USED   ADC_FILTERTOPOLOGY_
    #define ADC_CFG1_TRANSFERTYPE      ADC_TRANSFERTYPE_
    /* Capacitors that can be fractional should have *
     * a numerator 0-63 and a denominator 1 or 64.   *
     * CA may have a value 1-127.                    *
     * CB may only have a value 2-64                 */

    #define ADC_CFG1_FILTER_GT_C1_NUMERATOR_VAL    (ul)
    #define ADC_CFG1_FILTER_GT_C1_DENOMINATOR_VAL  (ul)
    #define ADC_CFG1_FILTER_GT_C2_NUMERATOR_VAL    (ul)
    #define ADC_CFG1_FILTER_GT_C2_DENOMINATOR_VAL  (ul)
    #define ADC_CFG1_FILTER_GT_C3_VAL              (ul)
    #define ADC_CFG1_FILTER_GT_C4_VAL              (ul)
    #define ADC_CFG1_FILTER_GT_Cp_VAL              (ul)
    #define ADC_CFG1_FILTER_GT_Cpp_NUMERATOR_VAL   (ul)
    #define ADC_CFG1_FILTER_GT_Cpp_DENOMINATOR_VAL (ul)
    #define ADC_CFG1_FILTER_GT_CA_VAL              (ul)
    #define ADC_CFG1_FILTER_GT_CB_VAL              (ul)

    #define ADC_CFG1_FILTER_IDEAL_BIQUAD_NUM0      ()
    #define ADC_CFG1_FILTER_IDEAL_BIQUAD_NUM1      ()
    #define ADC_CFG1_FILTER_IDEAL_BIQUAD_NUM2      ()
    #define ADC_CFG1_FILTER_IDEAL_BIQUAD_DEN0      ()
    #define ADC_CFG1_FILTER_IDEAL_BIQUAD_DEN1      ()
    #define ADC_CFG1_FILTER_IDEAL_BIQUAD_DEN2      ()

    #define ADC_CFG1_FILTER_UAB_BIQUAD_NUM0        ()
    #define ADC_CFG1_FILTER_UAB_BIQUAD_NUM1        ()
    #define ADC_CFG1_FILTER_UAB_BIQUAD_NUM2        ()
    #define ADC_CFG1_FILTER_UAB_BIQUAD_DEN0        ()
    #define ADC_CFG1_FILTER_UAB_BIQUAD_DEN1        ()
    #define ADC_CFG1_FILTER_UAB_BIQUAD_DEN2        ()

    #define ADC_CFG1_UABH_A_STARTUP_DELAY    ((uint32)((uint32)u << CyUAB_STARTUP_DELAY_SHIFT))
    #define ADC_CFG1_UABH_B_STARTUP_DELAY    ((uint32)((uint32)u << CyUAB_STARTUP_DELAY_SHIFT))

    #if (ADC_CFG1_FILTERTYPE_USED == ADC_FILTERTOPOLOGY_LOW_Q)
        /*  C1 = Bbranch
         *  C2 = Cbranch
         *  CA = Abranch + Fbranch */
        #define ADC_CFG1_UABH_A_LOWQDYN_CAP_B_VAL    ((0u < ADC_CFG1_FILTER_GT_C1_NUMERATOR_VAL) \
                                                           ? ((64u == ADC_CFG1_FILTER_GT_C1_NUMERATOR_VAL) \
                                                             ? (uint32)((uint32)1u << CyUAB_CB_64_SHIFT) \
                                                             : (uint32)(ADC_CFG1_FILTER_GT_C1_NUMERATOR_VAL << CyUAB_CB_VAL_SHIFT)) \
                                                           : ((64u == ADC_CFG1_FILTER_GT_Cp_VAL) \
                                                             ? (uint32)((uint32)1u << CyUAB_CB_64_SHIFT) \
                                                             : (uint32)(ADC_CFG1_FILTER_GT_Cp_VAL << CyUAB_CB_VAL_SHIFT)))
        #define ADC_CFG1_UABH_A_LOWQDYN_CAP_C_VAL ((uint32)(ADC_CFG1_FILTER_GT_C2_NUMERATOR_VAL << CyUAB_CC_VAL_SHIFT))
        #define ADC_CFG1_UABH_A_LOWQDYN_CAP_F_VAL_PRE (ADC_CFG1_FILTER_GT_CA_VAL/4u)
        #define ADC_CFG1_UABH_A_LOWQDYN_CAP_F_VAL ((uint32)(ADC_CFG1_UABH_A_LOWQDYN_CAP_F_VAL_PRE << CyUAB_CF_VAL_SHIFT))
        #define ADC_CFG1_UABH_A_LOWQDYN_CAP_A_VAL ((uint32)((ADC_CFG1_FILTER_GT_CA_VAL - (2u * (ADC_CFG1_UABH_A_LOWQDYN_CAP_F_VAL_PRE + 1u))) << CyUAB_CA_VAL_SHIFT))

        #define ADC_CFG1_UABH_A_LOWQDYN_CAP_ABCF_VAL ((ADC_CFG1_UABH_A_LOWQDYN_CAP_A_VAL) \
                                                           |  (ADC_CFG1_UABH_A_LOWQDYN_CAP_B_VAL) \
                                                           |  (ADC_CFG1_UABH_A_LOWQDYN_CAP_C_VAL) \
                                                           |  (ADC_CFG1_UABH_A_LOWQDYN_CAP_F_VAL))
        /* C3  = Bbranch
         * C4  = Abranch
         * Cpp = Cbranch
         * CB  = Fbranch */
        #define ADC_CFG1_UABH_B_LOWQDYN_CAP_ABCF_VAL (((64u == ADC_CFG1_FILTER_GT_C3_VAL) \
                                                              ? (uint32)((uint32)1u << CyUAB_CB_64_SHIFT) \
                                                              : (uint32)(ADC_CFG1_FILTER_GT_C3_VAL << CyUAB_CB_VAL_SHIFT)) \
                                                       | (uint32)(ADC_CFG1_FILTER_GT_C4_VAL << CyUAB_CA_VAL_SHIFT) \
                                                       | (uint32)(ADC_CFG1_FILTER_GT_Cpp_NUMERATOR_VAL << CyUAB_CC_VAL_SHIFT) \
                                                       | (uint32)((uint32)((ADC_CFG1_FILTER_GT_CB_VAL / 2u) - 1u) << CyUAB_CF_VAL_SHIFT))


        #define ADC_CFG1_UABH_A_LOWQDYN_CAP_CTRL ((((ADC_CFG1_FILTER_GT_C1_NUMERATOR_VAL > 0u) \
                                                           && (ADC_CFG1_FILTER_GT_C1_DENOMINATOR_VAL > 1u)) \
                                                            ? (uint32)((uint32)1u << CyUAB_CB_GND_SHIFT) \
                                                            : 0u) \
                                                         | ((ADC_CFG1_FILTER_GT_C2_DENOMINATOR_VAL > 1u) \
                                                            ? (uint32)((uint32)1u << CyUAB_CC_GND_SHIFT) \
                                                            : 0u))
        #if (ADC_CFG1_FILTER_GT_C1_NUMERATOR_VAL > 0u) /* CB is C1*/
            #define ADC_CFG1_UABH_A_LOWQDYN_SW_CB_IN0    ((ADC_UABH_ALL_OPEN_CB_IN0 \
                                                                &   ~((uint32)CyUAB_CLOCK_MASK << (ADC_UABH_A_halfuab__X0 << 2u))) \
                                                                |   ((uint32)CyUAB_CLK_PHI1 << (ADC_UABH_A_halfuab__X0 << 2u)))

            #define ADC_CFG1_UABH_A_LOWQDYN_SW_CB_IN1    ((CyUAB_CLK_PHI2 << CyUAB_SW_BG_MODBIT_SHIFT) \
                                                              |  (CyUAB_CLK_PHI4 << CyUAB_SW_BR_MODBIT_SHIFT) \
                                                              |  (CyUAB_CLK_PHI4 << CyUAB_SW_BV_MODBIT_SHIFT) \
                                                              |  (CyUAB_CLK_PHI4 << CyUAB_SW_BB_SHIFT))

            #define ADC_CFG1_UABH_A_LOWQDYN_SW_CB_TOP   ((CyUAB_CLK_PHI1 << CyUAB_SW_SB_SHIFT) \
                                                              |  (CyUAB_CLK_PHI2 << CyUAB_SW_GB_MODBIT_SHIFT) \
                                                              |  (CyUAB_CLK_PHI4 << CyUAB_SW_VB_MODBIT_SHIFT) \
                                                              |  (CyUAB_CLK_PHI4 << CyUAB_SW_RB_MODBIT_SHIFT) \
                                                              | (((ADC_CFG1_FILTER_GT_C1_DENOMINATOR_VAL > 1u) \
                                                                  ? CyUAB_CLK_PHI2 \
                                                                  : CyUAB_CLK_PHI1) << CyUAB_SW_TB_SHIFT))
        #else /* CB is C' */
            #define ADC_CFG1_UABH_A_LOWQDYN_SW_CB_IN0    ((ADC_UABH_ALL_OPEN_CB_IN0 \
                                                                &   ~((uint32)CyUAB_CLOCK_MASK << (ADC_UABH_A_halfuab__X0 << 2u))) \
                                                                |   (CyUAB_CLK_PHI5 << (ADC_UABH_A_halfuab__X0 << 2u)))

            #define ADC_CFG1_UABH_A_LOWQDYN_SW_CB_IN1    ((CyUAB_CLK_PHI4 << CyUAB_SW_BG_MODBIT_SHIFT) \
                                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_BR_MODBIT_SHIFT) \
                                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_BV_MODBIT_SHIFT) \
                                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_BB_SHIFT))

            #define ADC_CFG1_UABH_A_LOWQDYN_SW_CB_TOP    ((CyUAB_CLK_PHI5 << CyUAB_SW_SB_SHIFT) \
                                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_RB_MODBIT_SHIFT) \
                                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_GB_MODBIT_SHIFT) \
                                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_VB_MODBIT_SHIFT) \
                                                                | (CyUAB_CLK_PHI5 << CyUAB_SW_TB_SHIFT))
        #endif /* (ADC_CFG1_FILTER_GT_C1_NUMERATOR_VAL > 0u) */

