gcristini/SkorpioTemperatureTest/PSOC-Firmware/SerialTemperatureSensor.cydsn/Generated_Source/PSoC4/ADC_FILTER.h
            #define ADC_CFG2_UABH_A_LOWQDYN_SW_CB_TOP   ((CyUAB_CLK_PHI1 << CyUAB_SW_SB_SHIFT) \
                                                              |  (CyUAB_CLK_PHI2 << CyUAB_SW_GB_MODBIT_SHIFT) \
                                                              |  (CyUAB_CLK_PHI4 << CyUAB_SW_VB_MODBIT_SHIFT) \
                                                              |  (CyUAB_CLK_PHI4 << CyUAB_SW_RB_MODBIT_SHIFT) \
                                                              | (((ADC_CFG2_FILTER_GT_C1_DENOMINATOR_VAL > 1u) \
                                                                  ? CyUAB_CLK_PHI2 \
                                                                  : CyUAB_CLK_PHI1) << CyUAB_SW_TB_SHIFT))
        #else /* CB is C' */
            #define ADC_CFG2_UABH_A_LOWQDYN_SW_CB_IN0    ((ADC_UABH_ALL_OPEN_CB_IN0 \
                                                                &   ~((uint32)CyUAB_CLOCK_MASK << (ADC_UABH_A_halfuab__X0 << 2u))) \
                                                                |   (CyUAB_CLK_PHI5 << (ADC_UABH_A_halfuab__X0 << 2u))

            #define ADC_CFG2_UABH_A_LOWQDYN_SW_CB_IN1    ((CyUAB_CLK_PHI4 << CyUAB_SW_BG_MODBIT_SHIFT) \
                                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_BR_MODBIT_SHIFT) \
                                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_BV_MODBIT_SHIFT) \
                                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_BB_SHIFT))

            #define ADC_CFG2_UABH_A_LOWQDYN_SW_CB_TOP    ((CyUAB_CLK_PHI5 << CyUAB_SW_SB_SHIFT) \
                                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_RB_MODBIT_SHIFT) \
                                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_GB_MODBIT_SHIFT) \
                                                                |   (CyUAB_CLK_PHI4 << CyUAB_SW_VB_MODBIT_SHIFT) \
                                                                |   (CyUAB_CLK_PHI5 << CyUAB_SW_TB_SHIFT))
        #endif /* (ADC_CFG2_FILTER_GT_C1_NUMERATOR_VAL > 0u) */

        #define ADC_CFG2_UABH_A_LOWQDYN_SW_CC_TOP    ((CyUAB_CLK_PHI1 << CyUAB_SW_SC_SHIFT) \
                                                           |  (CyUAB_CLK_PHI4 << CyUAB_SW_RC_MODBIT_SHIFT) \
                                                           |  (CyUAB_CLK_PHI2 << CyUAB_SW_GC_MODBIT_SHIFT) \
                                                           |  (CyUAB_CLK_PHI4 << CyUAB_SW_VC_MODBIT_SHIFT) \
                                                           |  (CyUAB_CLK_PHI4 << CyUAB_SW_ZC_SHIFT) \
                                                           | (((ADC_CFG2_FILTER_GT_C2_DENOMINATOR_VAL > 1u) \
                                                              ? CyUAB_CLK_PHI2 \
                                                              : CyUAB_CLK_PHI1) << CyUAB_SW_TC_SHIFT))

        #define ADC_CFG2_UABH_B_LOWQDYN_CAP_CTRL     ((ADC_CFG2_FILTER_GT_Cpp_DENOMINATOR_VAL > 1u) \
                                                            ? (uint32)((uint32)1u << CyUAB_CC_GND_SHIFT) \
                                                            : 0u)

        #define ADC_CFG2_UABH_B_LOWQDYN_SW_CC_TOP    ((CyUAB_CLK_PHI5 << CyUAB_SW_SC_SHIFT) \
                                                            | (CyUAB_CLK_PHI4 << CyUAB_SW_RC_MODBIT_SHIFT) \
                                                            | (CyUAB_CLK_PHI4 << CyUAB_SW_GC_MODBIT_SHIFT) \
                                                            | (CyUAB_CLK_PHI4 << CyUAB_SW_VC_MODBIT_SHIFT) \
                                                            | (CyUAB_CLK_PHI4 << CyUAB_SW_ZC_SHIFT) \
                                                            | (((ADC_CFG2_FILTER_GT_Cpp_DENOMINATOR_VAL > 1u) \
                                                            ? CyUAB_CLK_PHI4 \
                                                            : CyUAB_CLK_PHI5 ) << CyUAB_SW_TC_SHIFT))

    /*******************************************************************************
    * CFG2 High-Q definitions
    *******************************************************************************/

    #elif (ADC_CFG2_FILTERTYPE_USED == ADC_FILTERTOPOLOGY_HIGH_Q)
        /*  C4 = Abranch  *
         *  C2 = Bbranch  *
         *  Cp = Cbranch  *
         *  CA = Fbranch  */
        #define ADC_CFG2_UABH_A_HIGHQDYN_CAP_ABCF_VAL (((64u == ADC_CFG2_FILTER_GT_C2_NUMERATOR_VAL) \
                                                              ? ((uint32)1u << CyUAB_CB_64_SHIFT) \
                                                              : (ADC_CFG2_FILTER_GT_C2_NUMERATOR_VAL << CyUAB_CB_VAL_SHIFT)) \
                                                            | (ADC_CFG2_FILTER_GT_Cp_VAL << CyUAB_CC_VAL_SHIFT) \
                                                            | (ADC_CFG2_FILTER_GT_C4_VAL << CyUAB_CA_VAL_SHIFT) \
                                                            | ((uint32)((ADC_CFG2_FILTER_GT_CA_VAL / 2u) - 1u) << CyUAB_CF_VAL_SHIFT))
        /* C3  = Abranch
         * Cpp = Bbranch
         * C1  = Cbranch
         * CB  = Fbranch */
        #define ADC_CFG2_UABH_B_HIGHQDYN_CAP_ABCF_VAL (((64u == ADC_CFG2_FILTER_GT_Cpp_NUMERATOR_VAL) \
                                                              ? ((uint32)1u << CyUAB_CB_64_SHIFT) \
                                                              : (ADC_CFG2_FILTER_GT_Cpp_NUMERATOR_VAL << CyUAB_CB_VAL_SHIFT)) \
                                                       | (ADC_CFG2_FILTER_GT_C3_VAL << CyUAB_CA_VAL_SHIFT) \
                                                       | (ADC_CFG2_FILTER_GT_C1_NUMERATOR_VAL << CyUAB_CC_VAL_SHIFT) \
                                                       | ((uint32)((ADC_CFG2_FILTER_GT_CB_VAL / 2u) - 1u) << CyUAB_CF_VAL_SHIFT))


        #define ADC_CFG2_UABH_A_HIGHQDYN_SW_CB_TOP ((CyUAB_CLK_PHI1 << CyUAB_SW_SB_SHIFT) \
                                                        |  (CyUAB_CLK_PHI2 << CyUAB_SW_GB_MODBIT_SHIFT) \
                                                        |  (CyUAB_CLK_PHI4 << CyUAB_SW_RB_MODBIT_SHIFT) \
                                                        |  (CyUAB_CLK_PHI4 << CyUAB_SW_VB_MODBIT_SHIFT) \
                                                        |  ((1u < ADC_CFG2_FILTER_GT_C2_DENOMINATOR_VAL) \
                                                            ? (CyUAB_CLK_PHI2 << CyUAB_SW_TB_SHIFT) \
                                                            : (CyUAB_CLK_PHI5 << CyUAB_SW_TB_SHIFT)))

        #define ADC_CFG2_UABH_B_HIGHQDYN_SW_CB_TOP ((CyUAB_CLK_PHI5 << CyUAB_SW_SB_SHIFT) \
                                                        |  (CyUAB_CLK_PHI4 << CyUAB_SW_GB_MODBIT_SHIFT) \
                                                        |  (CyUAB_CLK_PHI4 << CyUAB_SW_RB_MODBIT_SHIFT) \
                                                        |  (CyUAB_CLK_PHI4 << CyUAB_SW_VB_MODBIT_SHIFT) \
                                                        |  ((1u < ADC_CFG2_FILTER_GT_Cpp_DENOMINATOR_VAL) \
                                                            ? (CyUAB_CLK_PHI4 << CyUAB_SW_TB_SHIFT) \
                                                            : (CyUAB_CLK_PHI5 << CyUAB_SW_TB_SHIFT)))

        #define ADC_CFG2_UABH_B_HIGHQDYN_SW_CC_TOP ((CyUAB_CLK_PHI1 << CyUAB_SW_ZC_SHIFT) \
                                                        |  ((CyUAB_CLK_PHI2 << CyUAB_SW_GC_MODBIT_SHIFT)) \
                                                        |  ((CyUAB_CLK_PHI4 << CyUAB_SW_SC_SHIFT)) \
                                                        |  ((CyUAB_CLK_PHI4 << CyUAB_SW_RC_MODBIT_SHIFT)) \
                                                        |  ((CyUAB_CLK_PHI4 << CyUAB_SW_VC_MODBIT_SHIFT)) \
                                                        |  ((1u < ADC_CFG2_FILTER_GT_C1_DENOMINATOR_VAL) \
                                                            ? (CyUAB_CLK_PHI2 << CyUAB_SW_TC_SHIFT) \
                                                            : (CyUAB_CLK_PHI5 << CyUAB_SW_TC_SHIFT)))

        #define ADC_CFG2_UABH_A_HIGHQDYN_CAP_CTRL ((1u < ADC_CFG2_FILTER_GT_C2_DENOMINATOR_VAL) \
                                                            ? ((uint32)1u << CyUAB_CB_GND_SHIFT) \
                                                            : 0u )

        #define ADC_CFG2_UABH_B_HIGHQDYN_CAP_CTRL (((1u < ADC_CFG2_FILTER_GT_Cpp_DENOMINATOR_VAL) \
                                                            ? ((uint32)1u << CyUAB_CB_GND_SHIFT) \
                                                            : 0u) \
                                                        | ((1u < ADC_CFG2_FILTER_GT_C1_DENOMINATOR_VAL) \
                                                            ? ((uint32)1u << CyUAB_CC_GND_SHIFT) \
                                                            : 0u))

    #endif /*(ADC_CFG2_FILTERTYPE_USED == ADC_FILTERTOPOLOGY_LOW_Q)*/
#endif /* (0u != ADC_FILTER_CFG2_FILTER_PRESENT) */

