gcristini/SkorpioTemperatureTest/PSOC-Firmware/SerialTemperatureSensor.cydsn/Generated_Source/PSoC4/ADC_FILTER.h
        #define ADC_CFG3_UABH_B_HIGHQDYN_SW_CB_TOP ((CyUAB_CLK_PHI5 << CyUAB_SW_SB_SHIFT) \
                                                        |  (CyUAB_CLK_PHI4 << CyUAB_SW_GB_MODBIT_SHIFT) \
                                                        |  (CyUAB_CLK_PHI4 << CyUAB_SW_RB_MODBIT_SHIFT) \
                                                        |  (CyUAB_CLK_PHI4 << CyUAB_SW_VB_MODBIT_SHIFT) \
                                                        |  ((1u < ADC_CFG3_FILTER_GT_Cpp_DENOMINATOR_VAL) \
                                                            ? (CyUAB_CLK_PHI4 << CyUAB_SW_TB_SHIFT) \
                                                            : (CyUAB_CLK_PHI5 << CyUAB_SW_TB_SHIFT)))

        #define ADC_CFG3_UABH_B_HIGHQDYN_SW_CC_TOP ((CyUAB_CLK_PHI1 << CyUAB_SW_ZC_SHIFT) \
                                                        |  ((CyUAB_CLK_PHI2 << CyUAB_SW_GC_MODBIT_SHIFT)) \
                                                        |  ((CyUAB_CLK_PHI4 << CyUAB_SW_SC_SHIFT)) \
                                                        |  ((CyUAB_CLK_PHI4 << CyUAB_SW_RC_MODBIT_SHIFT)) \
                                                        |  ((CyUAB_CLK_PHI4 << CyUAB_SW_VC_MODBIT_SHIFT)) \
                                                        |  ((1u < ADC_CFG3_FILTER_GT_C1_DENOMINATOR_VAL) \
                                                            ? (CyUAB_CLK_PHI2 << CyUAB_SW_TC_SHIFT) \
                                                            : (CyUAB_CLK_PHI5 << CyUAB_SW_TC_SHIFT)))

        #define ADC_CFG3_UABH_A_HIGHQDYN_CAP_CTRL ((1u < ADC_CFG3_FILTER_GT_C2_DENOMINATOR_VAL) \
                                                            ? ((uint32)1u << CyUAB_CB_GND_SHIFT) \
                                                            : 0u )

        #define ADC_CFG3_UABH_B_HIGHQDYN_CAP_CTRL (((1u < ADC_CFG3_FILTER_GT_Cpp_DENOMINATOR_VAL) \
                                                            ? ((uint32)1u << CyUAB_CB_GND_SHIFT) \
                                                            : 0u) \
                                                        | ((1u < ADC_CFG3_FILTER_GT_C1_DENOMINATOR_VAL) \
                                                            ? ((uint32)1u << CyUAB_CC_GND_SHIFT) \
                                                            : 0u))

    #endif /*(ADC_CFG3_FILTERTYPE_USED == ADC_FILTERTOPOLOGY_LOW_Q)*/
#endif /* (0u != ADC_FILTER_CFG3_FILTER_PRESENT) */


#endif /* (ADC_ANY_CONFIG_USES_FILTER  != 0u)   */
#endif /* !defined(CY_ADC_FILTER_H) */
/* [] END OF FILE */
